garyPenhook/PIC-Assembler/edc/PIC18F04Q41.PIC
        <edc:SFRDef edc:access="nn----nn" edc:cname="OPA1CON3" edc:desc="" edc:impl="0xc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----uu" edc:name="OPA1CON3" edc:nzwidth="8" edc:por="00----xx" edc:_modsrc="DOS-04501_opamp_v7-KV00F.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xA6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSS" edc:mask="0x3" edc:name="PSS" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS" edc:mask="0x3" edc:name="FMS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PSS0" edc:mask="0x1" edc:name="PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PSS1" edc:mask="0x1" edc:name="PSS1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS0" edc:mask="0x1" edc:name="FMS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FMS1" edc:mask="0x1" edc:name="FMS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1PSS" edc:mask="0x3" edc:name="OPA1PSS" edc:nzwidth="0x5"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1FMS" edc:mask="0x3" edc:name="OPA1FMS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1PSS0" edc:mask="0x1" edc:name="OPA1PSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1PSS1" edc:mask="0x1" edc:name="OPA1PSS1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1FMS0" edc:mask="0x1" edc:name="OPA1FMS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1FMS1" edc:mask="0x1" edc:name="OPA1FMS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPA1HWC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="OPA1HWC" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04501_opamp_v7-KV00F.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xA7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HWCL" edc:mask="0x7" edc:name="HWCL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="ORPOL" edc:mask="0x1" edc:name="ORPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH" edc:mask="0x7" edc:name="HWCH" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OREN" edc:mask="0x1" edc:name="OREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="HWCL0" edc:mask="0x1" edc:name="HWCL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCL1" edc:mask="0x1" edc:name="HWCL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCL2" edc:mask="0x1" edc:name="HWCL2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="HWCH0" edc:mask="0x1" edc:name="HWCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH1" edc:mask="0x1" edc:name="HWCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HWCH2" edc:mask="0x1" edc:name="HWCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1HWCL" edc:mask="0x7" edc:name="OPA1HWCL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA1ORPOL" edc:mask="0x1" edc:name="OPA1ORPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH" edc:mask="0x7" edc:name="OPA1HWCH" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="OPA1OREN" edc:mask="0x1" edc:name="OPA1OREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1HWCL0" edc:mask="0x1" edc:name="OPA1HWCL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCL1" edc:mask="0x1" edc:name="OPA1HWCL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCL2" edc:mask="0x1" edc:name="OPA1HWCL2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH0" edc:mask="0x1" edc:name="OPA1HWCH0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH1" edc:mask="0x1" edc:name="OPA1HWCH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1HWCH2" edc:mask="0x1" edc:name="OPA1HWCH2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPA1OFFSET" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="OPA1OFFSET" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04501_opamp_v7-KV00F.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xA8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFFSET" edc:mask="0xff" edc:name="OFFSET" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OFFSET0" edc:mask="0x1" edc:name="OFFSET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET1" edc:mask="0x1" edc:name="OFFSET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET2" edc:mask="0x1" edc:name="OFFSET2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET3" edc:mask="0x1" edc:name="OFFSET3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET4" edc:mask="0x1" edc:name="OFFSET4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET5" edc:mask="0x1" edc:name="OFFSET5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET6" edc:mask="0x1" edc:name="OFFSET6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET7" edc:mask="0x1" edc:name="OFFSET7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1OFFSET" edc:mask="0xff" edc:name="OPA1OFFSET" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1OFFSET0" edc:mask="0x1" edc:name="OPA1OFFSET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET1" edc:mask="0x1" edc:name="OPA1OFFSET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET2" edc:mask="0x1" edc:name="OPA1OFFSET2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET3" edc:mask="0x1" edc:name="OPA1OFFSET3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET4" edc:mask="0x1" edc:name="OPA1OFFSET4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET5" edc:mask="0x1" edc:name="OPA1OFFSET5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET6" edc:mask="0x1" edc:name="OPA1OFFSET6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1OFFSET7" edc:mask="0x1" edc:name="OPA1OFFSET7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="OPA1ORS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="OPA1ORS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-04501_opamp_v7-KV00F.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0xA9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORS" edc:mask="0x1f" edc:name="ORS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ORS0" edc:mask="0x1" edc:name="ORS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS1" edc:mask="0x1" edc:name="ORS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS2" edc:mask="0x1" edc:name="ORS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS3" edc:mask="0x1" edc:name="ORS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS4" edc:mask="0x1" edc:name="ORS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA1ORS" edc:mask="0x1f" edc:name="OPA1ORS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA1ORS0" edc:mask="0x1" edc:name="OPA1ORS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1ORS1" edc:mask="0x1" edc:name="OPA1ORS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1ORS2" edc:mask="0x1" edc:name="OPA1ORS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1ORS3" edc:mask="0x1" edc:name="OPA1ORS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA1ORS4" edc:mask="0x1" edc:name="OPA1ORS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x2" edc:_addr="0xAA"/>
        <edc:SFRDef edc:access="nn--r-r-" edc:cname="ACTCON" edc:desc="" edc:impl="0xca" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0-0-" edc:name="ACTCON" edc:nzwidth="8" edc:por="00--0-0-" edc:_addr="0xAC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS" edc:mask="0x1" edc:name="ORS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="UD" edc:mask="0x1" edc:name="UD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTORS" edc:mask="0x1" edc:name="ACTORS" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTLOCK" edc:mask="0x1" edc:name="ACTLOCK" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="ACTUD" edc:mask="0x1" edc:name="ACTUD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTEN" edc:mask="0x1" edc:name="ACTEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="OSCCON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000-000" edc:name="OSCCON1" edc:nzwidth="8" edc:por="-000-000" edc:_addr="0xAD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NDIV" edc:mask="0xf" edc:name="NDIV" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NDIV0" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV1" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV2" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV3" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
