garyPenhook/PIC-Assembler/edc/PIC18F04Q41.PIC
        <edc:SFRDef edc:access="rnn-rrrr" edc:cname="PIE7" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="PIE7" edc:nzwidth="8" edc:por="000-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4AF">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I2C1RXIE" edc:mask="0x1" edc:name="I2C1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIE" edc:mask="0x1" edc:name="I2C1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IE" edc:mask="0x1" edc:name="I2C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIE" edc:mask="0x1" edc:name="I2C1EIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC3IE" edc:mask="0x1" edc:name="CLC3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3PIE" edc:mask="0x1" edc:name="PWM3PIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM3IE" edc:mask="0x1" edc:name="PWM3IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-n-nnnn" edc:cname="PIE8" edc:desc="" edc:impl="0xaf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0-0000" edc:name="PIE8" edc:nzwidth="8" edc:por="0-0-0000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U2RXIE" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIE" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIE" edc:mask="0x1" edc:name="U2EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IE" edc:mask="0x1" edc:name="U2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CLC4IE" edc:mask="0x1" edc:name="CLC4IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SCANIE" edc:mask="0x1" edc:name="SCANIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIE9" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIE9" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U3RXIE" edc:mask="0x1" edc:name="U3RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3TXIE" edc:mask="0x1" edc:name="U3TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3EIE" edc:mask="0x1" edc:name="U3EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U3IE" edc:mask="0x1" edc:name="U3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3SCNTIE" edc:mask="0x1" edc:name="DMA3SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3DCNTIE" edc:mask="0x1" edc:name="DMA3DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3ORIE" edc:mask="0x1" edc:name="DMA3ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3AIE" edc:mask="0x1" edc:name="DMA3AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn--n" edc:cname="PIE10" edc:desc="" edc:impl="0xf9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000--0" edc:name="PIE10" edc:nzwidth="8" edc:por="00000--0" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2IE" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TMR4IE" edc:mask="0x1" edc:name="TMR4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4SCNTIE" edc:mask="0x1" edc:name="DMA4SCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIE" edc:mask="0x1" edc:name="DMA4DCNTIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIE" edc:mask="0x1" edc:name="DMA4ORIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIE" edc:mask="0x1" edc:name="DMA4AIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rnnnnrnn" edc:cname="PIR0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q41_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x4B3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWIF" edc:mask="0x1" edc:name="SWIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HLVDIF" edc:mask="0x1" edc:name="HLVDIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIF" edc:mask="0x1" edc:name="OSFIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSWIF" edc:mask="0x1" edc:name="CSWIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMIF" edc:mask="0x1" edc:name="NVMIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC1IF" edc:mask="0x1" edc:name="CLC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIF" edc:mask="0x1" edc:name="CRCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCIF" edc:mask="0x1" edc:name="IOCIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
